app/controllers/projects_controller.rb

  def projects

    @projects = Project.where(user_id: current_user.id)
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 1]]

  def add_new_project
    @project = Project.create(name: params[:name], user_id: current_user.id)
---
INSERT INTO "projects" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "New Project"], ["created_at", "2018-01-27 12:47:22.583473"], ["updated_at", "2018-01-27 12:47:22.583473"], ["user_id", 1]]

  def delete_project
    @project = Project.find_by(id: params[:id])
    @project.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]

  def edit_project
    @project = Project.find_by(id: params[:id])
    @project.update(name: params[:new_name])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "789"], ["updated_at", "2018-02-09 22:34:10.912572"], ["id", 7]]