app/controllers/tasks_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "tasks" ("name", "position", "created_at", "updated_at", "project_id") VALUES (?, ?, ?, ?, ?)  [["name", "dasffg"], ["position", 1], ["created_at", "2018-01-27 13:01:29.766399"], ["updated_at", "2018-01-27 13:01:29.766399"], ["project_id", 2]]
---
  def add_new_task_to_project
    @project = Project.find_by(id: params[:project_id])
    @task = Task.create(name: params[:name], position: params[:position_id], project_id: params[:project_id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "Все сделать"], ["updated_at", "2018-01-31 21:11:45.097426"], ["id", 19]]
---
  def edit_task
    puts 'edit task method'
    @task = Task.find_by(id: params[:id])
    @task.update(name: params[:new_name])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "position" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["position", 1], ["updated_at", "2018-01-27 13:01:42.087212"], ["id", 2]]
---
  def change_position

    puts params[:tasks].to_json

    @tasksvalues =  params[:tasks].values.map do |task|
      @task = Task.find_by(id: task[:id])
      @task.update(position:task[:position])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", 1], ["updated_at", "2018-01-30 22:07:09.110258"], ["id", 12]]
---
  def complete_task
    @task = Task.find_by(id: params[:id])
    puts @task.id, @task.status
    if @task.status == 0
      @task.update(status: 1)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "tasks" SET "deadline" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["deadline", "2018-01-01"], ["updated_at", "2018-01-27 13:01:52.508307"], ["id", 7]]
---
  def expired_task
    @task = Task.find_by(id: params[:id])
    @task.update(deadline: params[:date])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
  def delete_task
    @task = Task.find_by(id: params[:id])
    @task.destroy